import static Denis.TasksForInterviewDenis.*;
import static Igor.TaskForInterviewIgor.*;

public class Main {
    public static void main(String[] args) {
//        task1();
//        task2();
//        -> task3.txt
//        -> task4.txt
//        task5();
//        task6();
//        task7();
//        task8();
//        task9();
//        task10();
//        task11();
//        -> task19.txt;
//        task20();
//        -> task20.txt;
//        task21();
//        -> task21.txt;
//        task22();
//        -> task23.txt
//        -> task24.txt
        task26();
        task27();
// Очень сложно. Задание 8
//        Задача, которая используется/бывает/встречается на собеседованиях.
//        Дан массив чисел {−6, 2, 5, −8, 8, 10, 4, −7, 12, 1}
//        Необходимо найти два числа, сумма которых равна −2.
//        Напечатать эти числа в консоль.
//          • Подсказка
//              Может потребоваться отсортировать массив с помощью Arrays.sort(arr).
//          • Критерии оценки
//              – Найдены два числа, удовлетворяющие условию задачи.
//              – При изменении значений массива в консоль выводится корректный результат.
//              – В консоль выведен результат решения задания.
// Очень сложно. Задание 9
//        Усложняем предыдущую задачу. Найдите все пары чисел, сумма которых равна −2. Напечатайте их в консоль.
//          • Критерии оценки
//              – Найдены все пары чисел, удовлетворяющие условию задачи.
//              – При изменении значений массива в консоль выводится корректный результат.
//              – В консоль выведен результат решения задания.
    }
}